In [ ]:
# use reset_index() to make it back into a DataFrame
#reset => removes keys as index values and convert it into columns so IT CAN BE REFERED LATER
# ['n'] is series. [['n']] is a dataframe
# get_group('value1','value2')
# using apply function to create a new column

In [5]:
import pandas as pd
import numpy as np
data_dict = {'wage': [3.10, 3.24, 3.00, 6.00, 5.30, 8.75],
             'educ': [11.0, 12.0, 11.0, 8.0, 12.0, 16.0],
             'exper': [2.0, 22.0, 2.0, 44.0, 7.0, 9.0],
             'female': [1.0, 1.0, 0.0, 0.0, 0.0, 0.0],
             'married': [0.0, 1.0, 0.0, 1.0, 1.0, 1.0]}

df_wage = pd.DataFrame(data_dict)    # DataFrame constructor
df_wage                              # Display the DataFrame

   wage  educ  exper  female  married
0  3.10  11.0    2.0     1.0      0.0
1  3.24  12.0   22.0     1.0      1.0
2  3.00  11.0    2.0     0.0      0.0
3  6.00   8.0   44.0     0.0      1.0
4  5.30  12.0    7.0     0.0      1.0
5  8.75  16.0    9.0     0.0      1.0

In [6]:
print(df_wage.mean())
print(df_wage.median())

wage        4.898333
educ       11.666667
exper      14.333333
female      0.333333
married     0.666667
dtype: float64
wage        4.27
educ       11.50
exper       8.00
female      0.00
married     1.00
dtype: float64

In [3]:
df_wage.median()['wage'] # series access by row lables
df_wage.median()[0] # series access by row lables

4.27

In [15]:
df_wage.describe()
df_wage.index
df_wage.columns
#use reset_index() to make it back into a DataFrame
#reset => removes keys as index values and conert it into columns

Index(['wage', 'educ', 'exper', 'sex', 'married'], dtype='object')

In [27]:
# GROUP BY => split , apply,compine/ calc

df_wage_grp = df_wage.groupby(['sex'])
df_wage_grp['married'].count()
df_wage_grp['educ'].max()
#arg sort => perform and provides rank int

sex
F    12.0
M    18.0
Name: educ, dtype: float64

In [21]:
#AGG
#print(df_wage_grp.describe())
df_wage_grp['wage'].agg([np.mean,np.median])

       mean  median
sex
F    3.1700    3.17
M    5.7625    5.65

In [18]:
df_wage_grp.groups.keys()

dict_keys(['F', 'M'])

In [22]:
#rename the agg columns
df_wage_grp.agg(mean_Wage=('wage',np.mean),exper_max=('exper',np.max))

     mean_Wage  exper_max
sex
F       3.1700       22.0
M       5.7625       44.0

In [23]:
#Transformation
# convert F = wage * 100 ; M = wage * 10

df_wage["new_wage"] = df_wage.groupby(['sex'])['wage'].transform(lambda x : x*100 )

df_wage

df_wage["new_wage"] = df_wage.groupby(['sex'])['wage'].transform(lambda x : x.min() ) # taking min of each sex
df_wage

df_wage["new_wage_max"] = df_wage.groupby(['sex'])['wage'].transform('max') # taking min of each sex
df_wage

    wage  educ  exper sex  married  new_wage  new_wage_max
0   3.10  11.0    2.0   F      0.0       3.1          3.24
1   3.24  12.0   22.0   F      1.0       3.1          3.24
2   3.00  11.0    2.0   M      0.0       3.0          8.75
3   6.00   8.0   44.0   M      1.0       3.0          8.75
4   5.30  12.0    7.0   M      1.0       3.0          8.75
5   8.75  16.0    9.0   M      1.0       3.0          8.75
6   3.10  11.0   12.0   F      0.0       3.1          3.24
7   3.24  12.0   22.0   F      1.0       3.1          3.24
8   3.00  11.0    5.0   M      0.0       3.0          8.75
9   6.00  18.0   44.0   M      1.0       3.0          8.75
10  5.30  12.0   17.0   M      1.0       3.0          8.75
11  8.75  16.0    9.0   M      1.0       3.0          8.75

In [8]:
#APPLY
df_wage["new_wage_exp"] = df_wage.apply(lambda x: x.wage + x.exper *0.5,axis=1)
df_wage

   wage  educ  exper sex  married  new_wage_exp
0  3.10  11.0    2.0   F      0.0          4.10
1  3.24  12.0   22.0   F      1.0         14.24
2  3.00  11.0    2.0   M      0.0          4.00
3  6.00   8.0   44.0   M      1.0         28.00
4  5.30  12.0    7.0   M      1.0          8.80
5  8.75  16.0    9.0   M      1.0         13.25

In [29]:
# FILTER
def filter_func(x):
    return x['exper'].std() < 1

df_filter = df_wage.groupby(['exper']).filter(filter_func)
df_filter
#df_filter = df_wage.groupby(['exper']).filter(lambda x : x['exper'] < 3)
df_wage

    wage  educ  exper sex  married  new_wage  new_wage_max
0   3.10  11.0    2.0   F      0.0       3.1          3.24
1   3.24  12.0   22.0   F      1.0       3.1          3.24
2   3.00  11.0    2.0   M      0.0       3.0          8.75
3   6.00   8.0   44.0   M      1.0       3.0          8.75
4   5.30  12.0    7.0   M      1.0       3.0          8.75
5   8.75  16.0    9.0   M      1.0       3.0          8.75
6   3.10  11.0   12.0   F      0.0       3.1          3.24
7   3.24  12.0   22.0   F      1.0       3.1          3.24
8   3.00  11.0    5.0   M      0.0       3.0          8.75
9   6.00  18.0   44.0   M      1.0       3.0          8.75
10  5.30  12.0   17.0   M      1.0       3.0          8.75
11  8.75  16.0    9.0   M      1.0       3.0          8.75

In [30]:
#APPLY Group
df_wage.groupby(['exper'])['wage'].apply(lambda x: x.mean)

exper
2.0     <bound method Series.mean of 0    3.1\n2    3....
5.0     <bound method Series.mean of 8    3.0\nName: 5...
7.0     <bound method Series.mean of 4    5.3\nName: 7...
9.0     <bound method Series.mean of 5     8.75\n11   ...
12.0    <bound method Series.mean of 6    3.1\nName: 1...
17.0    <bound method Series.mean of 10    5.3\nName: ...
22.0    <bound method Series.mean of 1    3.24\n7    3...
44.0    <bound method Series.mean of 3    6.0\n9    6....
Name: wage, dtype: object

In [ ]:
data = pd.read_csv('4D_results_long.csv')
data.head(10)

In [ ]:
data.columns

In [ ]:
data.describe()

In [ ]:
data_grp= data.groupby(['prize_type'])
data_grp.size()

In [ ]:
#DataFrame column selection in GroupBy
print(data_grp['number'])

In [ ]:
data_grp.describe()
#use reset_index() to make it back into a DataFrame

In [ ]:
data_grp['number'].describe()

In [ ]:
# Selecting a group
data_grp.get_group('2nd').head(10)

In [ ]:
# Iterating through groups
for name, group in data_grp:
    print(name)
    print(group.shape)
    print(type(group))

In [ ]:
data_grp['number'].mean()

In [ ]:
print(type(data_grp['number'].mean()))
data_grp['number'].mean().reset_index() # default index

In [ ]:
data_grp.size()

In [ ]:
#AGG aggreatgate
import numpy as np
# Min/Median/Max of number for each weekday-prize_type combination
# group by 'weekday' and 'prize_type and extract 'number' column
weekday_prize_gpby = data.groupby(['weekday', 'prize_type'])
weekday_prize_gpby

In [ ]:
weekday_prize_gpby['week_no'].describe()

In [ ]:
weekday_prize_gpby[['number']].agg([np.min, np.median, np.max])

In [ ]:
help(weekday_prize_gpby.get_group)
# Selecting a group
weekday_prize_gpby.get_group(('Sat','1st')).head(10)

In [ ]:
#TRANSFORMATION GROUPBY

In [ ]:
# use reset index to convert series data as data frame

In [ ]:
#FILTER GROUPBY

In [ ]:
#APPLY GROUPBY